//---------------------------------------------------------------------------
#include "CTypeVan.h"
//---------------------------------------------------------------------------
CTypeVan type_of_van;
//---------------------------------------------------------------------------
CTypeVan::CTypeVan()
{
  rast << SElement12<int>(6, 231, 200, 200, 460, 200, 200, 231, 0, 0, 0, 1);
  name << "ЧМЭ3";
  rast << SElement12<int>(6, 213, 220, 240, 580, 240, 220, 213, 0, 0, 0, 1);
  name << "ТЭП-60";
  rast << SElement12<int>(6, 286, 230, 230, 500, 230, 230, 286, 0, 0, 0, 1);
  name << "ЧС-4Т";
  rast << SElement12<int>(6, 230, 210, 210, 440, 210, 210, 230, 0, 0, 0, 1);
  name << "М-62";
  rast << SElement12<int>(4, 286, 300, 450, 300, 286, 0, 0, 0, 0, 0, 1);
  name << "ВЛ-80";
  rast << SElement12<int>(6, 218, 185, 185, 527, 185, 185, 218, 0, 0, 0, 1);
  name << "Локомотив";
//...........................................................................
  rast << SElement12<int>(8, 114, 185, 135, 185, 874, 185, 135, 185, 114, 0, 0);
  name << "цистерна";//  name << "цистерна для нефтепродуктов 15-871";
  rast << SElement12<int>(8, 156, 185, 135, 185, 547, 185, 135, 185, 156, 0, 0);
  name << "цистерна";//  name << "цистерна для нефти 15-880";
  rast << SElement12<int>(8, 114, 185, 135, 185, 1162, 185, 135, 185, 114, 0, 0);
  name << "цистерна";//  name << "цистерна для аммиака 15-1581";
  rast << SElement12<int>(4, 159, 185, 515, 185, 159, 0, 0, 0, 0, 0, 0);
  name << "цистерна";//  name << "цистерна для битума";
  rast << SElement12<int>(4, 119, 185, 527, 185, 119, 0, 0, 0, 0, 0, 0);
  name << "цистерна";//  name << "цистерна для бензина и нефтепродуктов 15-869";
  rast << SElement12<int>(4, 153, 185, 527, 185, 173, 0, 0, 0, 0, 0, 0);
  name << "цистерна";//  name << "цистерна для бензина с площадкой";
  rast << SElement12<int>(4, 153, 185, 527, 185, 153, 0, 0, 0, 0, 0, 0);
  name << "цистерна";//  name << "цистерна для цемента";
  rast << SElement12<int>(4, 193, 185, 527, 185, 153, 0, 0, 0, 0, 0, 0);
  name << "цистерна";//  name << "цистерна для олеума";
  rast << SElement12<int>(4, 119, 185, 588, 185, 119, 0, 0, 0, 0, 0, 0);
  name << "цистерна";//иск
  rast << SElement12<int>(4, 119, 185, 595, 185, 119, 0, 0, 0, 0, 0, 0);
  name << "цистерна";//  name << "цистерна для бензина 15-1443";
  rast << SElement12<int>(4, 199, 185, 845, 185, 199, 0, 0, 0, 0, 0, 0);
  name << "цистерна";//  name << "цистерна для поливинилхлорида";
  rast << SElement12<int>(4, 119, 185, 965, 185, 119, 0, 0, 0, 0, 0, 0);
  name << "цистерна";//  name << "цистерна для кальц. соды 15-884";
//...........................................................................
  rast << SElement12<int>(4, 119, 185, 480, 185, 119, 0, 0, 0, 0, 0, 0);
  name << "хоппер-дозатор";
  rast << SElement12<int>(4, 148, 185, 535, 185, 148, 0, 0, 0, 0, 0, 0);
  name << "полувагон-хоппер";//"полувагон-хоппер 20-471";
  rast << SElement12<int>(4, 152, 185, 547, 185, 152, 0, 0, 0, 0, 0, 0);
  name << "хоппер";//  name << "крытый вагон-хоппер для цемента";
  rast << SElement12<int>(4, 124, 185, 565, 185, 124, 0, 0, 0, 0, 0, 0);
  name << "хоппер";//  name << "думпкар, модель 31-638";
  rast << SElement12<int>(4, 119, 185, 585, 185, 119, 0, 0, 0, 0, 0, 0);
  name << "хоппер";//  name << "крытый вагон-хоппер для цемента 11-715";
  rast << SElement12<int>(4, 119, 185, 685, 185, 119, 0, 0, 0, 0, 0, 0);
  name << "хоппер";//  name << "крытый вагон-хоппер для зерна 11-739";
  rast << SElement12<int>(4, 119, 185, 713, 185, 119, 0, 0, 0, 0, 0, 0);
  name << "хоппер";//  name << "крытый вагон-хоппер для мин. удобрений 11-740";
  rast << SElement12<int>(4, 140, 185, 850, 185, 140, 0, 0, 0, 0, 0, 0);
  name << "хоппер";//иск
  rast << SElement12<int>(4, 140, 185, 870, 185, 140, 0, 0, 0, 0, 0, 0);
  name << "хоппер";//иск
  rast << SElement12<int>(4, 140, 185, 960, 185, 140, 0, 0, 0, 0, 0, 0);
  name << "хоппер";
//...........................................................................
  rast << SElement12<int>(4, 153, 185, 745, 185, 153, 0, 0, 0, 0, 0, 0);
  name << "платформа";
  rast << SElement12<int>(4, 153, 185, 787, 185, 153, 0, 0, 0, 0, 0, 0);
  name << "платформа";// "платформа с мет. бортами 13-401";
  rast << SElement12<int>(4, 153, 185, 1287, 185, 153, 0, 0, 0, 0, 0, 0);
  name << "платформа";//"платформа 13-470";
  rast << SElement12<int>(4, 166, 185, 1466, 185, 166, 0, 0, 0, 0, 0, 0);
  name << "платф. для авто";//  name << "двухярусная платформа для легк. автомобилей 13-479";
  rast << SElement12<int>(4, 180, 185, 1737, 185, 180, 0, 0, 0, 0, 0, 0);
  name << "платформа";
  rast << SElement12<int>(6, 136, 175, 175, 550, 175, 175, 136, 0, 0, 0, 0);
  name << "платформа";//"платформа 13-435";
  rast << SElement12<int>(6, 251, 150, 150, 1420, 150, 150, 251, 0, 0, 0, 0);
  name << "платформа";//  name << "платформа для длинномерных грузов";
//...........................................................................
  rast << SElement12<int>(4, 153, 185, 798, 185, 153, 0, 0, 0, 0, 0, 0);
  name << "крытый вагон";
  rast << SElement12<int>(4, 144, 185, 815, 185, 144, 0, 0, 0, 0, 0, 0);
  name << "крытый вагон";
  rast << SElement12<int>(4, 201, 185, 975, 185, 201, 0, 0, 0, 0, 0, 0);
  name << "крытый вагон";//"крытый вагон для скота";
//...........................................................................
//  rast << SElement12<int>(4, 153, 185, 787, 185, 153, 0, 0, 0, 0, 0, 0);
//  name << "вагон для нефтебитума 17-494";
//  name << "вагон для нефтеб.";
  rast << SElement12<int>(4, 146, 185, 745, 185, 146, 0, 0, 0, 0, 0, 0);
  name << "вагон для нефтеб.";
  rast << SElement12<int>(4, 171, 185, 680, 185, 171, 0, 0, 0, 0, 0, 0);
//  name << "полувагон, модель 12-1000(119)";
  name << "полувагон";
  rast << SElement12<int>(4, 220, 185, 680, 185, 220, 0, 0, 0, 0, 0, 0);
  name << "полувагон";
  rast << SElement12<int>(4, 171, 185, 11930, 185, 171, 0, 0, 0, 0, 0, 0);
//  name << "цельнометаллический полувагон 22-478";
  name << "цельномет.полувагон";

  rast << SElement12<int>(4, 119, 185, 1150, 185, 119, 0, 0, 0, 0, 0, 0);
//  name << "вагон для гранулированных полимеров 17-495";
  name << "вагон для полимеров";
  rast << SElement12<int>(6, 123, 175, 175, 694, 175, 175, 123, 0, 0, 0, 0);
  name << "полувагон";
  rast << SElement12<int>(6, 108, 170, 170, 594, 170, 170, 108, 0, 0, 0, 0);
  name << "думпкар";//"думпкар 31-634";
  rast << SElement12<int>(8, 156, 185, 135, 185, 702, 185, 135, 185, 156, 0, 0);
  name << "полувагон";
  rast << SElement12<int>(4, 190, 240, 1370, 240, 190, 0, 0, 0, 0, 0, 0);
  name << "пассажирский вагон";
  rast << SElement12<int>(4, 190, 240, 1485, 240, 190, 0, 0, 0, 0, 0, 0);
  name << "пассажирский вагон";
  rast << SElement12<int>(4, 190, 240, 1050, 240, 190, 0, 0, 0, 0, 0, 0);
  name << "вагон электрички";
  rast << SElement12<int>(4, 166, 185, 1520, 185, 166, 0, 0, 0, 0, 0, 0);
  name << "рефрежиратор";
}
//---------------------------------------------------------------------------
CTypeVan::~CTypeVan()
{
  Clear();
  rast.Clear();
  name.Clear();
}
//---------------------------------------------------------------------------
CString CTypeVan::GetType(SElement12<int> &r, int &lok)
{
  int size = r[0];
  if(size < 2)
    return "ошибка";
  CString ret = CString(r[0]) + "-осный вагон";
  int min = 100000;
  int res = -1;
  for(unsigned i = 0; i < rast.GetSize(); i ++)
  {
    if(rast[i][0] == 4 && size == 4)
    {
      int sum[3] = {0, 0, 0};
      sum[0] = abs(rast[i][2] - (r[2]+r[4])/2);
      sum[1] = abs(rast[i][3] - r[3]);
      sum[2] = sum[0] + sum[1];
      if(min > sum[2])
      {
        min = sum[2];
        res = i;
      }
    }
    if(rast[i][0] == 6 && size == 6)
    {
      int sum[6] = {0, 0, 0, 0, 0, 0};
      sum[0] = abs(rast[i][2] - r[2]);
      sum[1] = abs(rast[i][3] - r[3]);
      sum[2] = abs(rast[i][4] - r[4]);
      sum[3] = abs(rast[i][5] - r[5]);
      sum[4] = abs(rast[i][6] - r[6]);
      sum[5] = sum[0] + sum[1] + sum[2] + sum[3] + sum[4];
      if(min > sum[5])
      {
        min = sum[5];
        res = i;
      }
    }
    if(rast[i][0] == 8 && size == 8)
    {
      int sum[5] = {0, 0, 0, 0, 0};
      sum[0] = abs(rast[i][2] - (r[2]+r[8])/2);
      sum[1] = abs(rast[i][3] - (r[3]+r[7])/2);
      sum[2] = abs(rast[i][4] - (r[4]+r[6])/2);
      sum[3] = abs(rast[i][5] - r[5]);
      sum[4] = sum[0] + sum[1] + sum[2] + sum[3];
      if(min > sum[4])
      {
        min = sum[4];
        res = i;
      }
    }
  }
  lok = (res == -1 || min > 20000)? 0 : rast[res][11];
  return (res == -1 || min > 20000)? ret : name[res];
}
//---------------------------------------------------------------------------
void CTypeVan::Clear()
{
  type.Clear();
  rv.Clear();
  lokomotiv.Clear();
}
//---------------------------------------------------------------------------
void CTypeVan::AddVan(SElement12<int> &r)
{
  rv << r;
}
//---------------------------------------------------------------------------
void CTypeVan::Run()
{
  int lok;
  for(unsigned i = 0; i < rv.GetSize(); i ++)
  {
    type << GetType(rv[i], lok);
    lokomotiv << lok;
  }
}
//---------------------------------------------------------------------------
CString CTypeVan::GetType(const unsigned &n, int &lok)
{
  if(n < type.GetSize())
  {
    lok = lokomotiv[n];
    return type[n];
  }
  return CString("ошибка");
}
//---------------------------------------------------------------------------

